### Importing Libraries

In [2]:
# Importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

### Importing Data

In [7]:
# Path
path= r"C:\Users\nabar\OneDrive\Documents\03-2025 Instacart Basket Analysis"
# Dataframe
df = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

### Data Wrangling

In [10]:
df.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [12]:
df.shape

(206209, 10)

In [16]:
# Renaming columns
df = df.rename(columns={ 
    'Surnam' : 'Last Name',  
    'n_dependants' : 'Number_of_Dependents', 
    'fam_status' : 'Family Status'})

In [20]:
df.columns

Index(['user_id', 'First Name', 'Last Name', 'Gender', 'STATE', 'Age',
       'date_joined', 'Number_of_Dependents', 'Family Status', 'income'],
      dtype='object')

In [22]:
df.describe()

             user_id            Age  Number_of_Dependents         income
count  206209.000000  206209.000000         206209.000000  206209.000000
mean   103105.000000      49.501646              1.499823   94632.852548
std     59527.555167      18.480962              1.118433   42473.786988
min         1.000000      18.000000              0.000000   25903.000000
25%     51553.000000      33.000000              0.000000   59874.000000
50%    103105.000000      49.000000              1.000000   93547.000000
75%    154657.000000      66.000000              3.000000  124244.000000
max    206209.000000      81.000000              3.000000  593901.000000

In [24]:
# Missing values
missing_values = df.isnull().sum()

In [26]:
missing_values

user_id                     0
First Name              11259
Last Name                   0
Gender                      0
STATE                       0
Age                         0
date_joined                 0
Number_of_Dependents        0
Family Status               0
income                      0
dtype: int64

In [28]:
# Duplicate rows
duplicates = df.duplicated()

In [30]:
num_duplicates = duplicates.sum()

In [32]:
num_duplicates

0

There is no duplicate

In [35]:
df.dtypes

user_id                  int64
First Name              object
Last Name               object
Gender                  object
STATE                   object
Age                      int64
date_joined             object
Number_of_Dependents     int64
Family Status           object
income                   int64
dtype: object

### Combining Dataframes

In [38]:
# Importing dataframe
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'aggregated_ords_prods_merge.pkl'))

In [40]:
# Combining customer with ords_prods_merge
merge_df = pd.merge(ords_prods_merge, df, on='user_id', how='inner')

In [44]:
# Check the output
merge_df.head()

,order_id,user_id,eval_set,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,frequency_flag,First Name,Last Name,Gender,STATE,Age,date_joined,Number_of_Dependents,Family Status,income
0,2539329,1,prior,1,2,8,NaN,196,1,0,...,Non_frequent_customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2539329,1,prior,1,2,8,NaN,14084,2,0,...,Non_frequent_customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,2539329,1,prior,1,2,8,NaN,12427,3,0,...,Non_frequent_customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2539329,1,prior,1,2,8,NaN,26088,4,0,...,Non_frequent_customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,2539329,1,prior,1,2,8,NaN,26405,5,0,...,Non_frequent_customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [46]:
merge_df.shape

(32404859, 34)

### Exporting

In [51]:
merge_df.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_cust_merge.pkl'))